## Clusters Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "kubeconfig" -> "KUBECONFIG"
                              + property = "data.KUBECONFIG"
                            }
                          ~ secretKey = "kubeconfig" -> "KUBECONFIG"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SSH_PRIVATE_KEY"
                              + property = "data.SSH_PRIVATE_KEY"
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_PROXMOX_PASSWORD"
                              + property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_ACCESS_KEY_ID"
                              + property = "data.AWS_ACCESS_KEY_ID"
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_SECRET_ACCESS_KEY"
                              + property = "data.AWS_SECRET_ACCESS_KEY"
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "VAULT_TOKEN"
                              + property = "data.VAULT_TOKEN"
                            }
                          + secretKey = "VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_VAULT_TOKEN"
                              + property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "kubeconfig" -> "KUBECONFIG"
                              ~ property           = null -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "kubeconfig" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SSH_PRIVATE_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SSH_PRIVATE_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_PROXMOX_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_ACCESS_KEY_ID"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_ACCESS_KEY_ID"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_SECRET_ACCESS_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_SECRET_ACCESS_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "kubeconfig" -> "KUBECONFIG"
                              + property = "data.KUBECONFIG"
                            }
                          ~ secretKey = "kubeconfig" -> "KUBECONFIG"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SSH_PRIVATE_KEY"
                              + property = "data.SSH_PRIVATE_KEY"
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_PROXMOX_PASSWORD"
                              + property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_ACCESS_KEY_ID"
                              + property = "data.AWS_ACCESS_KEY_ID"
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_SECRET_ACCESS_KEY"
                              + property = "data.AWS_SECRET_ACCESS_KEY"
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "VAULT_TOKEN"
                              + property = "data.VAULT_TOKEN"
                            }
                          + secretKey = "VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_VAULT_TOKEN"
                              + property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "kubeconfig" -> "KUBECONFIG"
                              ~ property           = null -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "kubeconfig" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SSH_PRIVATE_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SSH_PRIVATE_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_PROXMOX_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_ACCESS_KEY_ID"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_ACCESS_KEY_ID"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_SECRET_ACCESS_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_SECRET_ACCESS_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "kubeconfig" -> "KUBECONFIG"
                              + property = "data.KUBECONFIG"
                            }
                          ~ secretKey = "kubeconfig" -> "KUBECONFIG"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SSH_PRIVATE_KEY"
                              + property = "data.SSH_PRIVATE_KEY"
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_PROXMOX_PASSWORD"
                              + property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_ACCESS_KEY_ID"
                              + property = "data.AWS_ACCESS_KEY_ID"
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                        },
                      + {
                          + remoteRef = {
                              + key      = "AWS_SECRET_ACCESS_KEY"
                              + property = "data.AWS_SECRET_ACCESS_KEY"
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "VAULT_TOKEN"
                              + property = "data.VAULT_TOKEN"
                            }
                          + secretKey = "VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_VAULT_TOKEN"
                              + property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "kubeconfig" -> "KUBECONFIG"
                              ~ property           = null -> "data.KUBECONFIG"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "kubeconfig" -> "KUBECONFIG"
                            # (1 unchanged attribute hidden)
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SSH_PRIVATE_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SSH_PRIVATE_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_PROXMOX_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_ACCESS_KEY_ID"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_ACCESS_KEY_ID"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_ACCESS_KEY_ID"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "AWS_SECRET_ACCESS_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.AWS_SECRET_ACCESS_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "AWS_SECRET_ACCESS_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
  
  Plan exit code: 0
  